/*********************************************************************************************
* 文件：humi_temp_sensor.c
* 作者：shench 2015.3.25
* 说明：商业温湿度传感器驱动程序，采用RS485通信方式
*       采用商业数字温湿度传感器，通过P2_0模拟单总线来进行温湿度数据的读取
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <stdio.h>
#include <ioCC2530.h>
#include "hal_uart.h"
#include "sapi.h"
#include "OnBoard.h"

#include "humi_temp_sensor.h"

/*********************************************************************************************
* 全局变量
*********************************************************************************************/
static uint8 f_szGetTempHumi[8]={0x01,0x03,0x00,0x00,0x00,0x02,0xC4,0x0B};//获取温湿度命令
static float f_fTemp = 0.0f;                                    //缓存温度值
static float f_fHumi = 0.0f;                                    //缓存湿度值

/*********************************************************************************************
* 本地函数原型
*********************************************************************************************/
static uint16 calc_crc(uint8 *pbuf, uint8 len);

/*********************************************************************************************
* UART RS485相关接口函数
*********************************************************************************************/
static void node_uart_init(void);
static void uart_callback_func(uint8 port, uint8 event);
static void uart_485_write(uint8 *pbuf, uint16 len);
static void node_uart_callback ( uint8 port, uint8 event );

/*********************************************************************************************
* 名称：hts_io_init()
* 功能：温湿度传感器IO口的初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void hts_io_init(void)
{
  // 初始化传感器代码 
  node_uart_init();
  
  P2SEL &= ~0x01;
  P2DIR |= 0x01;
  
}

/*********************************************************************************************
* 名称：get_hts_temp()
* 功能：获取温度值,作为外部接口
* 参数：无
* 返回：f_fTemp -- 温度值
* 修改：
* 注释：
*********************************************************************************************/
float get_hts_temp(void)
{
  return f_fTemp;
}

/*********************************************************************************************
* 名称：get_hts_humi()
* 功能：获取湿度值，作为外部接口
* 参数：无
* 返回：f_fHumi -- 湿度值
* 修改：
* 注释：
*********************************************************************************************/
float get_hts_humi(void)
{
  return f_fHumi;
}


/*********************************************************************************************
* 名称：hts_update()
* 功能：更新一次温湿度值，保存到全部静态变量中：f_fTemp、f_fHumi
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void hts_update(void)
{ 
  uart_485_write(f_szGetTempHumi, sizeof(f_szGetTempHumi));
}

/*********************************************************************************************
* 名称：uart_485_write()
* 功能：写485通讯
* 参数：pbuf -- 输入参数，发送命令指针
*       len -- 输入参数,发送命令长度
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
static void uart_485_write(uint8 *pbuf, uint16 len)
{
  P2_0 = 1;
  
  HalUARTWrite(HAL_UART_PORT_0, pbuf, len);
}

/*********************************************************************************************
* 名称：uart_callback_func()
* 功能：RS485通讯回调函数，使用延时
* 参数：port -- 输入参数，数据接收端口
*       event -- 输入参数，接收事件
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
static void uart_callback_func(uint8 port, uint8 event) 
{
  if (event & HAL_UART_TX_EMPTY) 
  {
    uint16 szDelay[] = {2000,1000,500,100,10,10000};
    MicroWait(szDelay[HAL_UART_BR_9600]);                       // 波特率越慢延时时间需越长,延时太长将影响数据接收
    P2_0 = 0;
  }
  
  node_uart_callback(port, event);
}

/*********************************************************************************************
* 名称：node_uart_callback()
* 功能：节点串口通讯回调函数
* 参数：port -- 输入参数，接收端口
*       event -- 输入参数，接收事件
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
static void node_uart_callback ( uint8 port ,uint8 event)
{
#define RBUFSIZE 128
  (void)event;
  uint8  ch;
  static uint8 szBuf[RBUFSIZE];
  static uint8  len = 0;
  
  // 接收通过串口传来的数据
  while (Hal_UART_RxBufLen(port))
  {
    HalUARTRead (port, &ch, 1);
    if (len > 0) 
    {
      szBuf[len++] = ch;
      if (len == 9) 
      {
        uint16 crc;
        crc = calc_crc(szBuf, 7);
        if (crc == ((szBuf[8]<<8) | szBuf[7])) 
        {
          int nTemp, nHumi;
          nHumi = (szBuf[3]<<8) | szBuf[4];
          nTemp = (szBuf[5]<<8) | szBuf[6];
          
          f_fHumi = (float)nHumi/10.0f;
          f_fTemp = (float)nTemp/10.0f;
        }
        len = 0;
      }
    } 
    else
    {
      if (len == 0 && ch == 0x01)
      {
        szBuf[len++] = ch;
      }
      else 
      {
        len = 0;
      }
    }
  }
}

/*********************************************************************************************
* 名称：node_uart_init()
* 功能：RS485串口初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
static void node_uart_init(void)
{
  halUARTCfg_t _UartConfigure;
  
  // UART 配置信息
  _UartConfigure.configured           = TRUE;
  _UartConfigure.baudRate             = HAL_UART_BR_9600;
  _UartConfigure.flowControl          = FALSE;
  _UartConfigure.rx.maxBufSize        = 128;
  _UartConfigure.tx.maxBufSize        = 128;
  _UartConfigure.flowControlThreshold = (128 / 2);
  _UartConfigure.idleTimeout          = 6;
  _UartConfigure.intEnable            = TRUE;
  _UartConfigure.callBackFunc         = uart_callback_func;
  
  HalUARTOpen (HAL_UART_PORT_0, &_UartConfigure);               //启动UART

}

/*********************************************************************************************
* 名称：calc_crc()
* 功能：crc校验
* 参数：pbuf -- 输入参数，校验指针
*       len -- 输入参数，校验数组长度
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
static uint16 calc_crc(uint8 *pbuf, uint8 len)
{
  uint16 crc = 0xffff;
  uint8 k, i;
  
  for (k = 0; k < len; k++) 
  {
    crc = crc ^ pbuf[k];
    for(i = 0; i < 8; i++) 
    {
	  uint8 tmp;
	  tmp = crc&1;
	  crc = crc>>1;
	  crc &= 0x7fff;
	  if (tmp == 1)
      {
        crc ^= 0xa001;
      }
	  crc &= 0xffff;
    }
  }
  
  return crc;
}
