/*********************************************************************************************
* 文件：humi_temp_sensor.h
* 作者：shench 2015.3.25
* 说明：商业温湿度驱动头文件
* 修改：
* 注释：对于传感器接口命名方式humi_temp_sensor简写为hts
*********************************************************************************************/
#ifndef HUMI_TEMP_SENSOR_H
#define HUMI_TEMP_SENSOR_H

/*********************************************************************************************
* 外部函数原型
*********************************************************************************************/
extern void hts_io_init(void);
extern void hts_update(void);
extern float get_hts_humi(void);
extern float get_hts_temp(void);

#endif // HUMI_TEMP_SENSOR_H
