/*********************************************************************************************
* 文件：sensor.c
* 作者：
* 说明：通用传感器控制接口程序
* 修改：
* 注释：
*********************************************************************************************/
#include "sensor.h"

unsigned char D0 = 0xFF;                                        // 主动上报使能，默认只允许A0主动上报
unsigned char D1 = 0;                                           // 默认关闭控制类传感器
unsigned int V0 = 5;                                           // 主动上报时间间隔，单位秒,0不主动上报
float A0 = 0.0;                                                 // 温度
float A1 = 0.0;                                                 // 湿度
float A2 = 0.0;                                                 // 光照强度
float A3 = 0;                                                   // 空气质量报警值
float A4 = 0.0;                                                 // 大气压力值
unsigned char A5 = 0;                                           // 三轴跌倒检测
float A6 = 0;                                                   // 红外测距
int A7=0;                                        
float A8 = 0, A9 = 0, A10 = 0;                                  // 板载温度、湿度、电压
unsigned char lis3dhFlag = 0;

/*********************************************************************************************
* 名称：sensor_init()
* 功能：
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void sensor_init(void)
{   
    relay_init();                                               // 初始化控制类传感器（继电器）
    ext_htu21d_init();                                          // 初始化温湿度传感器
    bh1750_init();                                              // 初始化光照传感器
    fbm320_init();                                              // 初始化大气压力
    lis3dhFlag = lis3dh_init();                                 // 三轴初始化
    ld3320_init();                                              // 语言识别初始化
}

/*********************************************************************************************
* 名称：sensor_type()
* 功能：
* 参数：
* 返回：返回传感器类型，3字节字符串表示
* 修改：
* 注释：
*********************************************************************************************/
char *sensor_type(void)
{
    return SENSOR_TYPE;                                           //返回传感器类型
}

/*********************************************************************************************
* 名称：sensor_control()
* 功能：传感器控制
* 参数：cmd - 控制命令
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensor_control(unsigned char cmd)
{
    if((cmd & 0x40) == 0x40)
    {
        relay_on(1);
    }
    else
    {
        relay_off(1);
    }
    if((cmd & 0x80) == 0x80)
    {
        relay_on(2);
    }
    else
    {
        relay_off(2);
    }
}

/*********************************************************************************************
* 名称：updateA0
* 功能：更新A0的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA0(void)
{
    A0 = ext_htu21d_get_data(EXT_TEMPERATURE)*0.01;             // 获取温度信息并更新A0
}

/*********************************************************************************************
* 名称：updateA1
* 功能：更新A1的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA1(void)
{
    A1 = ext_htu21d_get_data(EXT_HUMIDITY)*0.01;                // 获取湿度信息并更新A1
}

/*********************************************************************************************
* 名称：updateA2
* 功能：更新A2的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA2(void)
{
    A2 = bh1750_get_data();                                     // 获取光照强度信息并更新A2
}

/*********************************************************************************************
* 名称：updateA3
* 功能：更新A3的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA3(void)
{
    A3 = get_airgas_data();                                       // 获取空气质量信息并更新A3
}

/*********************************************************************************************
* 名称：updateA4
* 功能：更新A4的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA4(void)
{
    // 读取大气压力值，并更新A4
    float temperature = 0;                                        // 存储温度数据变量
    long pressure = 0;                                            // 存储压力数据变量
    
    fbm320_data_get(&temperature,&pressure);                      // 获取温度、压力数据
    A4 = pressure/100.0f;                                        // 转换压力单位为千帕
}

/*********************************************************************************************
* 名称：updateA5
* 功能：更新A5的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA5(void)
{
    float accx,accy,accz;
    static unsigned char ct = 0;
    if(A5 == 0) 
    {
        lis3dh_read_data(&accx,&accy,&accz);
        if(!(accx==0&&accy==0&&accz==0)) 
        {
            A5 = fallDect(accx,accy,accz);
        }
    }
    else
    {
        ct++;
        if(ct >= 3000/CheckTime)
        {
            ct = 0;
            A5 = 0;
        }
    }
}

/*********************************************************************************************
* 名称：updateA6
* 功能：更新A6的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA6(void)
{
    A6 = get_stadiometry_data();                                // 更新A6 红外距离
}

/*********************************************************************************************
* 名称：updateA7
* 功能：更新A7的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA7(void)
{
    A7 = ld3320_read();                                         // 更新A7 电池电压
}

/*********************************************************************************************
* 名称：updateA7
* 功能：更新A7的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA8(void)
{
    A8 = Htu21dTemperature_Get();                                   // 更新A7 电池电压
}

/*********************************************************************************************
* 名称：updateA7
* 功能：更新A7的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA9(void)
{
    A9 = Htu21dHumidity_Get();                                   // 更新A7 电池电压
}

/*********************************************************************************************
* 名称：updateA7
* 功能：更新A7的值
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void updateA10(void)
{
    A10 = BatteryVotage_Get();                                   // 更新A7 电池电压
}

/*********************************************************************************************
* 名称：sensor_poll()
* 功能：轮询传感器，并主动上报传感器数据
* 参数：t: 调用次数
* 返回：
* 修改：
* 注释：此函数每秒钟调用1次，t为调用次数
*********************************************************************************************/
void sensor_poll(unsigned int t)
{
    char buf[16] = {0};

    updateA0();
    updateA1();
    updateA2();
    updateA3();
    updateA4();
    updateA6();
    updateA8();
    updateA9();
    updateA10();
    
    if (V0 != 0)
    {
        if (t % V0 == 0)
        {
            zxbeeBegin();
            if (D0 & 0x01)
            {
                sprintf(buf, "%.1f", A0);
                zxbeeAdd("A0", buf);
            }
            if (D0 & 0x02)
            {
                //A1值打包
                sprintf(buf, "%.1f", A1);
                zxbeeAdd("A1", buf);
            }
            if (D0 & 0x04)
            {
                //A2值打包
                sprintf(buf, "%.1f", A2);
                zxbeeAdd("A2", buf);
            }
            if (D0 & 0x08)
            {
                //A3值打包
                sprintf(buf, "%.1f", A3);
                zxbeeAdd("A3", buf);
            }
            if (D0 & 0x10)
            {
                //A4值打包
                sprintf(buf, "%.1f", A4);
                zxbeeAdd("A4", buf);
            }
            if (D0 & 0x20)
            {
                sprintf(buf, "%d", A5);
                zxbeeAdd("A5", buf);
            }
            if (D0 & 0x40)
            {
                sprintf(buf, "%.1f", A6);
                zxbeeAdd("A6", buf);
            }
            if (D0 & 0x80)
            {
                //
            }
            sprintf(buf, "%.1f", A8);
            zxbeeAdd("A8", buf);
            sprintf(buf, "%.1f", A9);
            zxbeeAdd("A9", buf);
            sprintf(buf, "%.1f", A10);
            zxbeeAdd("A10", buf);
            char *p = zxbeeEnd();
            if (p != NULL)
            {
                rfUartSendData(p);                              //发送无线数据
            }
        }
    }
}

/*********************************************************************************************
* 名称：sensor_check()
* 功能：周期性检查函数，可设定轮询时间
* 参数：无
* 返回：设置轮询的时间，单位ms,范围:1-65535
* 修改：
* 注释：此函数用于需要快速做出相应的传感器
*********************************************************************************************/
unsigned short sensor_check()
{
    char pData[16];
    char *p = pData;
    static unsigned char lastA5 = 0;
    if(lis3dhFlag == 0)
        updateA5();
    updateA7();
    zxbeeBegin();
    if(lastA5 != A5)
    {
        sprintf(p,"%u",A5);
        zxbeeAdd("A5", p);
        lastA5 = A5;
    }
    if(A7 != 0)
    {
        sprintf(p,"%u",A7);
        zxbeeAdd("A7", p);  
    }
    p = zxbeeEnd();
    if (p != NULL) {
        rfUartSendData(p);
    }
    return CheckTime;                                               //返回值决定下次调用时间，此处为200ms
}

/*********************************************************************************************
* 名称：z_process_command_call()
* 功能：处理上层应用发过来的指令
* 参数：ptag: 指令标识 D0，D1， A0 ...
*       pval: 指令值， “？”表示读取，
*       obuf: 指令处理结果存放地址
* 返回：>0指令处理结果返回数据长度，0：没有返回数据，<0：不支持指令。
* 修改：
* 注释：
*********************************************************************************************/
int z_process_command_call(char* ptag, char* pval, char* obuf)
{
    int ret = -1;
    if (memcmp(ptag, "D0", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "D0=%d", D0);
        }
    }
    if (memcmp(ptag, "CD0", 3) == 0)
    {
        int v = atoi(pval);
        if (v > 0)
        {
            D0 &= ~v;
        }
    }
    if (memcmp(ptag, "OD0", 3) == 0)
    {
        int v = atoi(pval);
        if (v > 0)
        {
            D0 |= v;
        }
    }
    if (memcmp(ptag, "D1", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "D1=%d", D1);
        }
    }
    if (memcmp(ptag, "CD1", 3) == 0)  				            //若检测到CD1指令
    {
        int v = atoi(pval);                                     //获取CD1数据
        D1 &= ~v;                                               //更新D1数据
        sensor_control(D1);                                     //更新电磁阀直流电机状态
    }
    if (memcmp(ptag, "OD1", 3) == 0)  				            //若检测到OD1指令
    {
        int v = atoi(pval);                                     //获取OD1数据
        D1 |= v;                                                //更新D1数据
        sensor_control(D1);                                     //更新电磁阀直流电机状态
    }
    if (memcmp(ptag, "V0", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "V0=%d", V0);
        }
        else
        {
            V0 = atoi(pval);
        }
    }
    if (memcmp(ptag, "A0", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A0=%.1f", A0);
        }
    }
    if (memcmp(ptag, "A1", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A1=%.1f", A1);
        }
    }
    if (memcmp(ptag, "A2", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A2=%.1f", A2);
        }
    }
    if (memcmp(ptag, "A3", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A3=%.1f", A3);
        }
    }
    if (memcmp(ptag, "A4", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A4=%.1f", A4);
        }
    }
    if (memcmp(ptag, "A5", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A5=%d", A5);
        }
    }
    if (memcmp(ptag, "A6", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A6=%.1f", A6);
        }
    }
    if (memcmp(ptag, "A7", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A7=%d", A7);
        }
    }
    if (memcmp(ptag, "A8", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A8=%.1f", A8);
        }
    }
    if (memcmp(ptag, "A9", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A9=%.1f", A9);
        }
    }
    if (memcmp(ptag, "A10", 2) == 0)
    {
        if (pval[0] == '?')
        {
            ret = sprintf(obuf, "A10=%.1f", A10);
        }
    }
    return ret;
}

