/*********************************************************************************************
* 文件：relay.h
* 作者：
* 说明：relay头文件
* 修改：
* 注释：
*********************************************************************************************/
#ifndef _RELAY_h_
#define _RELAY_h_

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "hal_types.h"
#include <ioCC2530.h>

void relay_init(void);
void relay_on(unsigned char cmd);
void relay_off(unsigned char cmd);
unsigned char get_relay_status(void);

#endif