/*********************************************************************************************
* 文件：sensor.c
* 作者：fuyou 2018.7.13
* 说明：实训工位气象站驱动程序
*       A0-->温度
*       A1-->湿度
*       A2-->雨量
*       A3-->风向
*       A4-->风速
*       V0-->主动上报时间间隔,默认30s
*       D0-->(Bit0-Bit7)分别表示A0-A7主动上报使能
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "math.h"
#include "sapi.h"
#include "osal_nv.h"
#include "addrmgr.h"
#include "mt.h"
#include "hal_led.h"
#include "hal_adc.h"
#include "hal_uart.h"
#include "sensor.h"
#include "zxbee.h"
#include "zxbee-inf.h"
#include "htu21d.h"
#include "time.h"
#include "ExtInt.h"


/*********************************************************************************************
* 全局变量
*********************************************************************************************/
static uint8 D0 = 0xff;                                         // 默认打开主动上报功能
static float A0 = 0.0;                                          //A0-->温度
static float A1 = 0.0;                                          //A1-->湿度
static float A2 = 0;                                            //A2-->降雨量
static uint16 A3 = 0;                                           //A3-->风向
static float A4 = 0;                                            //A4-->风速
static uint16 V0 = 30;                                          //V0设置为上报时间间隔，默认为30s

float windSpeed=0,rainfall=0;

/*********************************************************************************************
* 名称：updateV0()
* 功能：更新V0的值
* 参数：*val -- 待更新的变量
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateV0(char *val)
{
    //将字符串变量val解析转换为整型变量赋值
    V0 = atoi(val);                                               // 获取数据上报时间更改值
}
/*********************************************************************************************
* 名称：updateA0()
* 功能：更新A0的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA0(void)
{
      // 读取温度值，并更新A0
      A0 = (htu21d_get_data(TEMP)/100.0f); 
}

/*********************************************************************************************
* 名称：updateA1()
* 功能：更新A1的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA1(void)
{
      // 读取湿度值，并更新A1
      A1 = (htu21d_get_data(HUMI)/100.0f);
}

/*********************************************************************************************
* 名称：updateA2()
* 功能：更新A2的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA2(void)
{
    A2 = rainfall;
}

/*********************************************************************************************
* 名称：updateA3()
* 功能：更新A3的值
* 参数：
* 返回：
* 修改：
* 注释：
    1-->北
    2-->东北
    3-->东
    4-->东南
    5-->南
    6-->西南
    7-->西
    8-->西北
*********************************************************************************************/
void updateA3(void)
{
    unsigned short value=0;
    
    value = HalAdcRead(1,HAL_ADC_RESOLUTION_12);                   //P01输入
    
    if((value>100)&&(value<=200))
    {
        A3 = 7;
    }
    else if((value>200)&&(value<=300))
    {
        A3 = 8;
    }
    else if((value>300)&&(value<=450))
    {
        A3 = 1;
    }
    else if((value>450)&&(value<=590))
    {
        A3 = 6;
    }
    else if((value>590)&&(value<=780))
    {
        A3 = 2;
    }
    else if((value>780)&&(value<=900))
    {
        A3 = 5;
    }
    else if((value>900)&&(value<=940))
    {
        A3 = 4;
    }
    else if((value>940)&&(value<=1000))
    {
        A3 = 3;
    }
    else
    {
        A3 = 0;
    }
}

/*********************************************************************************************
* 名称：updateA4()
* 功能：更新A4的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA4(void)
{
    A4 = windSpeed;
}

/*********************************************************************************************
* 名称：AdcIOInit()
* 功能：ADC,IO口初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void AdcIOInit(void)
{
    APCFG |= (1<<1);                                            //模拟 I/O 使能  
    P0SEL |= (1<<1);                                            //端口功能选择外设功能
    P0DIR &= ~(1<<1);                                           //设置输入模式  
}

/*********************************************************************************************
* 名称：rainInit
* 功能：雨量传感器初始胡
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void rainInit(void)
{
    ExtInt_init(Ext_P0,Ext_Pin0,Ext_dowm);                      //外部中断初始化，P00,下降沿
}

/*********************************************************************************************
* 名称：rainInit
* 功能：风传感器初始胡
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void windInit(void)
{
    /*风速初始化*/
    ExtInt_init(Ext_P0,Ext_Pin4,Ext_dowm);                      //外部中断初始化，P04,下降沿
    /*风向初始化*/
    AdcIOInit();                                                //ADC,IO口初始化
}

/*********************************************************************************************
* 名称：sensorInit()
* 功能：传感器硬件初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorInit(void)
{
    htu21d_init();                                              //温湿度传感器初始化
    rainInit();                                                 //雨量传感器初始化
    windInit();                                                 //风传感器初始化
    time1Int_init(50);                                          //定时器初始化

    //启动定时器，触发传感器上报数据事件：MY_REPORT_EVT
    osal_start_timerEx(sapi_TaskID, MY_REPORT_EVT, (uint16)((osal_rand()%10) * 1000));
    //启动定时器，触发传感器监测事件：MY_CHECK_EVT
    osal_start_timerEx(sapi_TaskID, MY_CHECK_EVT, 100);
}
/*********************************************************************************************
* 名称：sensorLinkOn()
* 功能：传感器节点入网成功调用函数
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorLinkOn(void)
{
    sensorUpdate();
}
/*********************************************************************************************
* 名称：sensorUpdate()
* 功能：处理主动上报的数据
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorUpdate(void)
{
    char pData[16];
    char *p = pData;

    ZXBeeBegin();                                                 // 智云数据帧格式包头

    // 根据D0的位状态判定需要主动上报的数值
    if ((D0 & 0x01) == 0x01)                                      // 若温度上报允许，则pData的数据包中添加温度数据
    {
        updateA0();
        sprintf(p, "%.1f", A0);
        ZXBeeAdd("A0", p);
    }
    if ((D0 & 0x02) == 0x02)                                      // 若湿度上报允许，则pData的数据包中添加湿度数据
    {
        updateA1();
        sprintf(p, "%.1f", A1);
        ZXBeeAdd("A1", p);
    }
    if ((D0 & 0x04) == 0x04)                                      // 若降雨量上报允许，则pData的数据包中添加风速数据
    {
        updateA2();
        sprintf(p, "%.1f", A2);
        ZXBeeAdd("A2", p);
    }
    if ((D0 & 0x08) == 0x08)                                      // 若风向上报允许，则pData的数据包中添加风向数据
    {
        updateA3();
        sprintf(p, "%d", A3);
        ZXBeeAdd("A3", p);
    }
    if ((D0 & 0x10) == 0x10)                                      // 若风速上报允许，则pData的数据包中添加降雨量数据
    {
        updateA4();
        sprintf(p, "%.1f", A4);
        ZXBeeAdd("A4", p);
    }

    p = ZXBeeEnd();                                               // 智云数据帧格式包尾
    if (p != NULL)
    {
        ZXBeeInfSend(p, strlen(p));	                                // 将需要上传的数据进行打包操作，并通过zb_SendDataRequest()发送到协调器
    }
}
/*********************************************************************************************
* 名称：sensorCheck()
* 功能：传感器监测
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorCheck(void)
{
}

/*********************************************************************************************
* 名称：ZXBeeUserProcess()
* 功能：解析收到的控制命令
* 参数：*ptag -- 控制命令名称
*       *pval -- 控制命令参数
* 返回：ret -- pout字符串长度
* 修改：
* 注释：
*********************************************************************************************/
int ZXBeeUserProcess(char *ptag, char *pval)
{
    int val;
    int ret = 0;
    char pData[16];
    char *p = pData;

    // 将字符串变量pval解析转换为整型变量赋值
    val = atoi(pval);
    // 控制命令解析
    if (0 == strcmp("CD0", ptag))                                 // 对D0的位进行操作，CD0表示位清零操作
    {
        D0 &= ~val;
    }
    if (0 == strcmp("OD0", ptag))                                 // 对D0的位进行操作，OD0表示位置一操作
    {
        D0 |= val;
    }
    if (0 == strcmp("D0", ptag))                                  // 查询上报使能编码
    {
        if (0 == strcmp("?", pval))
        {
            ret = sprintf(p, "%u", D0);
            ZXBeeAdd("D0", p);
        }
    }
    if (0 == strcmp("A0", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA0();
            ret = sprintf(p, "%.1f", A0);
            ZXBeeAdd("A0", p);
        }
    }
    if (0 == strcmp("A1", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA1();
            ret = sprintf(p, "%.1f", A1);
            ZXBeeAdd("A1", p);
        }
    }
    if (0 == strcmp("A2", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA1();
            ret = sprintf(p, "%.1f", A2);
            ZXBeeAdd("A2", p);
        }
    }
    if (0 == strcmp("A3", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA1();
            ret = sprintf(p, "%d", A3);
            ZXBeeAdd("A3", p);
        }
    }
    if (0 == strcmp("A4", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA1();
            ret = sprintf(p, "%.1f", A4);
            ZXBeeAdd("A4", p);
        }
    }
    if (0 == strcmp("V0", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            ret = sprintf(p, "%u", V0);                         	// 上报时间间隔
            ZXBeeAdd("V0", p);
        }
        else
        {
            updateV0(pval);
        }
    }
    return ret;
}
/*********************************************************************************************
* 名称：MyEventProcess()
* 功能：自定义事件处理
* 参数：event -- 事件编号
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void MyEventProcess( uint16 event )
{
    if (event & MY_REPORT_EVT)
    {
        sensorUpdate();
        //启动定时器，触发事件：MY_REPORT_EVT
        osal_start_timerEx(sapi_TaskID, MY_REPORT_EVT, V0*1000);
    }
    if (event & MY_CHECK_EVT)
    {
        sensorCheck();
        // 启动定时器，触发事件：MY_CHECK_EVT
        osal_start_timerEx(sapi_TaskID, MY_CHECK_EVT, 100);
    }
}