/*********************************************************************************************
* 文件：stepmotor.h
* 作者：Lixm 2017.10.17
* 说明：步进电机驱动代码头文件  
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 宏条件编译
*********************************************************************************************/
#ifndef __STEPMOTOR_H__
#define __STEPMOTOR_H__

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stm32f4xx.h"

#define STEP_RCC    RCC_AHB1Periph_GPIOB
#define STEP_GPIO   GPIOB
#define STEP_PIN    GPIO_Pin_8

#define DIR_RCC     RCC_AHB1Periph_GPIOB
#define DIR_GPIO    GPIOB
#define DIR_PIN     GPIO_Pin_9

#define EN_RCC      RCC_AHB1Periph_GPIOB
#define EN_GPIO     GPIOB
#define EN_PIN      GPIO_Pin_11

/*********************************************************************************************
* 内部原型函数
*********************************************************************************************/
void stepmotor_init(void);                                      //步进电机传感器初始化
void stepmotor_control(unsigned char cmd);                     //步进电机传感器控制

#endif /*__STEPMOTOR_H__*/

